clear;
clc;

for n = 300:100:1000
    % συμπλήρωση μιας μη τετραγωνικής μήτρας Α και
    % ενός διανύσματος b με τυχαίους αριθμούς
    % με την ελπίδα ότι η A'*A δεν είναι ιδιάζουσα
    m = n+1;          % ή m = 3*n+1, ή κάτι άλλο (πειραματιστείτε μόνοι σας!!)
    A = randn(m,n);
    b = randn(m,1);

    % επίλυση και εύρεση χρόνων εκτέλεσης:
    % πρώτα με τον τρόπο του MATLAB που
    % βασίζεται στην παραγοντοποίηση QR
    t0 = cputime;
    xqr = A \ b;
    temp = cputime;
    tqr(n/100-2) = temp - t0;

    % κατόπιν με τη χρήση των κανονικών εξισώσεων
    t0 = temp;
    B = A'*A; y = A'*b;
    xne = B \ y;
    temp = cputime;
    tne(n/100-2) = temp - t0;
end

ratio = tqr./tne;
plot(300:100:1000, ratio)