% ΔΕΔΟΜΕΝΑ ΠΡΟΒΛΗΜΑΤΟΣ
A = [1 0 1;2 3 5;5 3 -2;3 5 4;-1 6 3];
b = [4 -2 5 -2 1]';
B = [A, sum(A,2)];    % η μήτρα Α με μία έξτρα στήλη(το άθροισμα των άλλων τριών)



%% ΑΝΑΠΟΔΗ ΚΑΘΕΤΟΣ
x = A \ b

% Εκτύπωση νορμών x και υπολοίπου
disp(norm(x,2));
disp(norm((b-A*x),2));



%% ΠΑΡΑΓΟΝΤΟΠΟΙΗΣΗ QR
x = B \ b                % προειδοποίηση ελλιπούς τάξης & αύξηση ||x|| λόγω μεγέθυνσης 
                         % σφαλμάτων στρογγυλοποίησης κοντά σε ιδιάζουσα κατάσταση!

% Εκτύπωση νορμών x και υπολοίπου
disp(norm(x,2));
disp(norm((b-B*x),2));



%% ΕΛΑΧΙΣΤΑ ΤΕΤΡΑΓΩΝΑ ΜΕ SVD
[U,S,V] = svd(B);

% υπολογισμός αποκοπής r (λαμβάνονατς υπόψη την αριθμητική ακρίβεια)
%tol = max(size(B)) * eps(max(diag(S)));
%r = sum(diag(S) > tol);

% εναλλακτικά, υπολογισμός αποκοπής r ως την τάξη του μητρώου
r = rank(B);  % i already know that rank(B)=3

% Υπολογισμός z = U' * b
z = U'*b;

% Υπολογισμός του y (με την αποκοπή των ιδιοτιμών που είναι μικρότερες από την ανοχή)
y = zeros(size(z));
for i=1:r
    y(i) = z(i) / S(i,i);
end

% Υπολογισμός του x = V * y
x = V(:,1:r)*y(1:r)

% Εκτύπωση νορμών x και υπολοίπου
disp(norm(x,2));
disp(norm((b-B*x),2));
