n = 500;
C = randn(n,n);
A = C'*C;
xe = randn(n,1);            % η ακριβής λύση
b = A*xe;                   % παραγωγή του δεξιού μέλους

R = chol(A);                % παράγοντας Cholesky

% η παρακάτω γραμμή διατηρεί τη συμβατότητα με τη συνάρτηση 
% forsub
D = diag(diag(R)); L = D \ R'; bb = D \ b; p = 1:n;
y = forsub(L, bb, p);              % προς τα εμπρός αντικατάσταση R'y=b
x = backsub(R, y);              % προς τα πίσω αντικατάσταση Rx = y
disp("Σφάλμα Cholesky:")
rerx = norm(x-xe) / norm(xe)    % σφάλμα από τον αλγόριθμο Cholesky

xd = ainvb(A,b);    % αγνοείται η συμμετρική θετική
                    % ορισιμότητα,
                    % χρησιμοποιείται μερική οδήγηση

disp("Σφάλμα γενικής ρουτίνας:")
rerxd = norm(xd-xe) / norm(xe) % σφάλμα της γενικής ρουτίνας           
           